; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=3, packages=1, locations=7, density=0.5238095238095238, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=6, seed=47

(define (problem transport-06)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 - package
    l1 l2 l3 l4 l5 l6 l7 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at v1 l4)
    (at v2 l5)
    (at v3 l3)
    (road l6 l2)
    (road l1 l2)
    (road l2 l4)
    (road l2 l1)
    (road l2 l7)
    (road l4 l2)
    (road l5 l7)
    (road l2 l6)
    (road l7 l2)
    (road l3 l6)
    (road l7 l5)
    (road l6 l3)
    (road l1 l4)
    (road l4 l1)
    (road l6 l7)
    (road l7 l6)
    (road l4 l7)
    (road l7 l4)
    (road l3 l4)
    (road l4 l3)
    (road l1 l5)
    (road l5 l1)
    )
 (:goal  (and 
    (at p1 l3))))

; plan
1. (pick-up v2 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 0 of 1
2. (drive v2 l5 l1)
   deleted: (at v2 l5)
   added: (at v2 l1)
   goals met: 0 of 1
3. (drive v2 l1 l4)
   deleted: (at v2 l1)
   added: (at v2 l4)
   goals met: 0 of 1
4. (drive v2 l4 l3)
   deleted: (at v2 l4)
   added: (at v2 l3)
   goals met: 0 of 1
5. (drop v2 l3 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l3) (capacity v2 c1)
   goals met: 1 of 1
